d3mocide/Oscilla/firmware-c5/sdkconfig.defaults
# oscilla-c5 defaults. Radio features are enabled as their phases land.

CONFIG_IDF_TARGET="esp32c5"

# App and bootloader logs go to native USB, never the command channel
# (Rev D §3). ROM boot text still appears on UART0; OCP-SPEC §1.1 tolerates it.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Single-core: dispatch must outrank engines so `stop` lands (DESIGN §6.4).
CONFIG_FREERTOS_HZ=1000

# Fault, never hang (Rev D §4.3). PANIC is deliberate: the default only prints
# a warning, so a starved core stays wedged and the probe cannot even be
# reflashed over USB. Rebooting is always the better failure.
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y

CONFIG_COMPILER_WARN_WRITE_STRINGS=y
CONFIG_COMPILER_STACK_CHECK_MODE_NORM=y
